In [1]:
#dependencies

import pandas as pd

In [2]:
#Use Pandas to read data
avocado_sales_2018 = pd.read_csv("../Resources/clean_avocado.csv")

In [3]:
#print to view
avocado_sales_2018.head()

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
0,0,1/4/2015,1.22,40873.28,2819.50,28287.42,49.90,9716.46,9186.93,529.53,0.0,conventional,2015,Albany
1,1,1/11/2015,1.24,41195.08,1002.85,31640.34,127.12,8424.77,8036.04,388.73,0.0,conventional,2015,Albany
2,2,1/18/2015,1.17,44511.28,914.14,31540.32,135.77,11921.05,11651.09,269.96,0.0,conventional,2015,Albany
3,3,1/25/2015,1.06,45147.50,941.38,33196.16,164.14,10845.82,10103.35,742.47,0.0,conventional,2015,Albany
4,4,2/1/2015,0.99,70873.60,1353.90,60017.20,179.32,9323.18,9170.82,152.36,0.0,conventional,2015,Albany

In [4]:
#look for missing values
#awesome to see!
avocado_sales_2018.count()

Unnamed: 0      18722
Date            18722
AveragePrice    18722
Total Volume    18722
4046            18722
4225            18722
4770            18722
Total Bags      18722
Small Bags      18722
Large Bags      18722
XLarge Bags     18722
type            18722
year            18722
region          18722
dtype: int64

In [5]:
#get a list of all of our columns for easy reference
avocado_sales_2018.columns

Index(['Unnamed: 0', 'Date', 'AveragePrice', 'Total Volume', '4046', '4225',
       '4770', 'Total Bags', 'Small Bags', 'Large Bags', 'XLarge Bags', 'type',
       'year', 'region'],
      dtype='object')

In [6]:
#collect data that includes year 2018 - all cities
#'year' == 2018

avocado_sales_2018_df = avocado_sales_2018.loc[(avocado_sales_2018["year"] == 2018)]

In [7]:
#print
avocado_sales_2018_df

,Unnamed: 0,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
156,156,1/1/2018,1.47,113514.42,2622.70,101135.53,20.25,9735.94,5556.98,4178.96,0.00,conventional,2018,Albany
157,157,1/7/2018,1.13,98540.22,2940.63,76192.61,42.63,19364.35,8633.09,10707.93,23.33,conventional,2018,Albany
158,158,1/14/2018,1.42,95246.38,2897.41,76570.67,44.00,15734.30,10012.80,5721.50,0.00,conventional,2018,Albany
159,159,1/21/2018,1.69,135196.35,3133.37,116520.88,88.78,15453.32,10023.79,5429.53,0.00,conventional,2018,Albany
160,160,1/28/2018,1.57,93625.03,3101.17,74627.23,55.59,15841.04,11614.79,4159.58,66.67,conventional,2018,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...,...
18669,26512,11/4/2018,1.49,8300.71,152.99,521.23,0.00,7626.49,6953.34,673.15,0.00,organic,2018,Tampa
18670,26513,11/11/2018,1.54,9113.31,136.55,670.58,0.00,8306.18,7048.18,1258.00,0.00,organic,2018,Tampa
18671,26514,11/18/2018,1.52,12259.52,220.91,1231.73,0.00,10806.88,7333.34,3473.54,0.00,organic,2018,Tampa
18672,26515,11/25/2018,1.24,710.36,52.13,25.74,0.00,632.49,567.77,64.72,0.00,organic,2018,Tampa
18673,26516,12/2/2018,1.29,7374.15,176.32,5.44,0.00,7192.39,7192.39,0.00,0.00,organic,2018,Tampa

In [8]:
#drop column "Unnamed: 0"
#add at end inplace=True -> to allow panda to edit the original DF
avocado_sales_2018_df.drop(columns=["Unnamed: 0"], inplace=True)

In [9]:
#print to view
avocado_sales_2018_df

,Date,AveragePrice,Total Volume,4046,4225,4770,Total Bags,Small Bags,Large Bags,XLarge Bags,type,year,region
156,1/1/2018,1.47,113514.42,2622.70,101135.53,20.25,9735.94,5556.98,4178.96,0.00,conventional,2018,Albany
157,1/7/2018,1.13,98540.22,2940.63,76192.61,42.63,19364.35,8633.09,10707.93,23.33,conventional,2018,Albany
158,1/14/2018,1.42,95246.38,2897.41,76570.67,44.00,15734.30,10012.80,5721.50,0.00,conventional,2018,Albany
159,1/21/2018,1.69,135196.35,3133.37,116520.88,88.78,15453.32,10023.79,5429.53,0.00,conventional,2018,Albany
160,1/28/2018,1.57,93625.03,3101.17,74627.23,55.59,15841.04,11614.79,4159.58,66.67,conventional,2018,Albany
...,...,...,...,...,...,...,...,...,...,...,...,...,...
18669,11/4/2018,1.49,8300.71,152.99,521.23,0.00,7626.49,6953.34,673.15,0.00,organic,2018,Tampa
18670,11/11/2018,1.54,9113.31,136.55,670.58,0.00,8306.18,7048.18,1258.00,0.00,organic,2018,Tampa
18671,11/18/2018,1.52,12259.52,220.91,1231.73,0.00,10806.88,7333.34,3473.54,0.00,organic,2018,Tampa
18672,11/25/2018,1.24,710.36,52.13,25.74,0.00,632.49,567.77,64.72,0.00,organic,2018,Tampa
18673,12/2/2018,1.29,7374.15,176.32,5.44,0.00,7192.39,7192.39,0.00,0.00,organic,2018,Tampa

In [10]:
#export DF into a .csv
avocado_sales_2018_df.to_csv("avocado_sales_2018.csv")